tap "facebook/fb"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "homeport/tap"
tap "jkawamoto/fgo"
tap "remind101/formulae"
tap "wolever/git-blast"
cask "osxfuse"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Google App Engine
brew "app-engine-python"
# Archival front-end
brew "atool"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Real-time data compression library
brew "lzo"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# GNU multiple precision arithmetic library
brew "gmp"
# Tool for automated testing of webapps across many browsers
brew "chromedriver", restart_service: true
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Statistics utility to count lines of code
brew "cloc"
# JavaScript optimizing compiler
brew "closure-compiler"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Message bus system, providing inter-application communication
brew "dbus"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Run arbitrary commands when files change
brew "entr"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# GNU compiler collection
brew "gcc"
# GNOME XML library
brew "libxml2"
# Postgres C API library
brew "libpq"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go cross compile tool
brew "gox"
# GPG key agent
brew "gpg-agent"
# Library access to GnuPG
brew "gpgme"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Pager program similar to more
brew "less"
# Implementation of the file(1) command
brew "libmagic"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# C and C++ client library to the memcached server
brew "libmemcached"
# Library for USB device access
brew "libusb-compat"
# XML security library
brew "libxmlsec1"
# Powerful, lightweight programming language
brew "lua"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# File compressor
brew "lzop"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Recursively compute digests on files/directories
brew "md5deep"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@5.7"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@6"
# State machine compiler
brew "ragel"
# Source code line counter
brew "ohcount"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# PDF to HTML converter
brew "pdf2htmlex", link: false
# Python dependency management tool
brew "pipenv"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql"
# Object-relational database system
brew "postgresql@9.6", restart_service: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Progress: Coreutils Progress Viewer
brew "progress"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Highly performant implementation of Python 2 in Python
brew "pypy"
# Implementation of Python 3 in Python
brew "pypy3"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Reads and randomize lines from a file (or STDIN)
brew "randomize-lines"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Steel Bank Common Lisp system
brew "sbcl"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Yahoo! JavaScript and CSS compressor
brew "yuicompressor"
# The eXecutable Archive Format
brew "facebook/fb/xar"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# Build, upload, and create brew formula for golang application.
brew "jkawamoto/fgo/fgo"
# Easily assume AWS roles in your terminal
brew "remind101/formulae/assume-role"
# git-blast: show git branches sorted by last commit date Raw
brew "wolever/git-blast/git-blast"
cask "anki"
cask "arduino"
cask "atom"
cask "aws-vault"
cask "bricklink-studio"
cask "cloak"
cask "coconutbattery"
cask "daisydisk"
cask "divvy"
cask "etcher"
cask "flux"
cask "gimp"
cask "google-cloud-sdk"
cask "iterm2"
cask "itsycal"
cask "java"
cask "kiibohd-configurator"
cask "kindlegen"
cask "lastpass"
cask "lilypond"
cask "logitech-control-center"
cask "mactex"
cask "macvim"
cask "musescore"
cask "muzzle"
cask "rocket"
cask "send-to-kindle"
cask "sensiblesidebuttons"
cask "steam"
cask "teamviewer"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "xbox360-controller-driver-unofficial"
