tap "caskroom/cask"
tap "caskroom/drivers"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "remind101/formulae"
cask "java"
brew "app-engine-python"
brew "readline"
brew "augeas"
brew "autoconf"
brew "bash-completion"
brew "berkeley-db"
brew "boost"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre"
brew "glib"
brew "pixman"
brew "cairo"
brew "dialog"
brew "openssl"
brew "sqlite"
brew "python"
brew "certbot"
brew "libtool"
brew "cfssl"
brew "gmp"
brew "chromedriver", restart_service: true
brew "cloc"
brew "closure-compiler"
brew "cmake"
brew "ctop"
brew "dbus"
brew "libusb"
brew "dfu-util"
brew "direnv"
brew "libgcrypt"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "dos2unix"
brew "doxygen"
brew "entr"
brew "freetds"
brew "gcc"
brew "libxml2"
brew "python@2"
brew "gdal"
brew "geoip"
brew "git"
brew "git-flow"
brew "gnu-getopt"
brew "libunistring"
brew "gnupg"
brew "go"
brew "gpg-agent"
brew "gpgme"
brew "graphviz"
brew "grep"
brew "icu4c"
brew "htop"
brew "hub", args: ["devel"]
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "less"
brew "libevent"
brew "libmagic"
brew "memcached", restart_service: true
brew "libmemcached"
brew "libusb-compat"
brew "libxmlsec1"
brew "libyaml"
brew "little-cms2"
brew "lzo"
brew "lzop"
brew "make"
brew "maven"
brew "md5deep"
brew "md5sha1sum"
brew "minimal-racket"
brew "mysql"
brew "mysql@5.6", restart_service: true
brew "nmap"
brew "node"
brew "node@6"
brew "ragel"
brew "ohcount"
brew "openjpeg"
brew "openssl@1.1"
brew "ossp-uuid"
brew "pandoc"
brew "pango"
brew "pdf2htmlex"
brew "perl"
brew "phantomjs"
brew "pipenv"
brew "pkg-config"
brew "popt"
brew "postgresql"
brew "postgresql@9.6", restart_service: true
brew "progress"
brew "protobuf"
brew "pv"
brew "pypy"
brew "pypy3"
brew "qcachegrind"
brew "randomize-lines"
brew "redis"
brew "rpm"
brew "ruby"
brew "rust"
brew "s3cmd"
brew "sbcl"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "wget"
brew "yuicompressor"
brew "getsentry/tools/sentry-cli"
brew "remind101/formulae/assume-role"
cask "atom"
cask "aws-vault"
cask "cloak"
cask "etcher"
cask "flux"
cask "google-cloud-sdk"
cask "itsycal"
cask "kindlegen"
cask "lastpass"
cask "mactex"
cask "macvim"
cask "mojibar"
cask "send-to-kindle"
cask "steam"
cask "teamviewer"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "caskroom/drivers/logitech-control-center"
