tap "facebook/fb"
tap "filosottile/gomod"
tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "wolever/git-blast"
# Run your GitHub Actions locally 🚀
brew "act"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Google App Engine
brew "app-engine-python"
# Archival front-end
brew "atool"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Authenticate with AWS using your Okta credentials
brew "aws-okta"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Real-time data compression library
brew "lzo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Cross-platform make
brew "cmake"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Message bus system, providing inter-application communication
brew "dbus"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Terminal visual disk space navigator
brew "diskonaut"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU compiler collection
brew "gcc"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# C string library for manipulating Unicode strings
brew "libunistring"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go cross compile tool
brew "gox"
# Library access to GnuPG
brew "gpgme"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Command-line benchmarking tool
brew "hyperfine"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Pager program similar to more
brew "less"
# Implementation of the file(1) command
brew "libmagic"
# C and C++ client library to the memcached server
brew "libmemcached"
# Library for USB device access
brew "libusb-compat"
# Powerful, lightweight programming language
brew "lua"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# File compressor
brew "lzop"
# Utility for directing compilation
brew "make"
# Recursively compute digests on files/directories
brew "md5deep"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# High performance static file server
brew "miniserve"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@5.7"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# State machine compiler
brew "ragel"
# Source code line counter
brew "ohcount"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Python dependency management tool
brew "pipenv"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql"
# Object-relational database system
brew "postgresql@9.6"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Coreutils progress viewer
brew "progress"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# GNU Portable THreads
brew "pth"
# Monitor data's progress through a pipe
brew "pv"
# Highly performant implementation of Python 2 in Python
brew "pypy"
# Implementation of Python 3 in Python
brew "pypy3"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Reads and randomize lines from a file (or STDIN)
brew "randomize-lines"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Steel Bank Common Lisp system
brew "sbcl"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Provide version control info in shell prompts
brew "vcprompt"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# brew command to cleanly install binaries from Go modules
brew "filosottile/gomod/brew-gomod"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# git-blast: show git branches sorted by last commit date Raw
brew "wolever/git-blast/git-blast"
cask "8bitdo-firmware-updater"
cask "8bitdo-ultimate-software"
cask "anki"
cask "aws-vault"
cask "camo-studio"
cask "coconutbattery"
cask "daisydisk"
cask "divvy"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "itsycal"
cask "kiibohd-configurator"
cask "kitty"
cask "lastpass"
cask "logitech-options"
cask "mactex"
cask "macvim"
cask "muzzle"
cask "rocket"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"
